Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObject Constructor (Int32, Identifier)
 Creates a new reference model object instance using the given parameters.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModelObject(
	int ReferenceModelId,
	Identifier ID
)
Public Sub New (
	ReferenceModelId As Integer,
	ID As Identifier
)
Parameters
ReferenceModelId
Type: System.Int32
The identifier of the reference model.
ID
Type: Tekla.Structures.Identifier
The identifier for the new reference model object.
See Also
Reference
ReferenceModelObject Class
ReferenceModelObject Overload
Tekla.Structures.Model Namespace